{
	"enUS": [
		[
			"[12.0.0.115015] Leader Balance, Troop Balance & Pvp Rule Changes",
			1742407200,
			{
				"leader_text_title": "Leader Balance",
				"leader_text": "<pre><b>Anub'arak</b> \n•Health reduced to 1600, from 1440. \n•Heal from Burrow increased to 50%, from 33%. \n \n<b>Sneed</b> \n•Land Grab - Now increases Sneed's level by 2, up from 1. \n \n<b>Ragnaros</b> \n•Blast wave now deals an additional 75 damage. \n•Blast wave now affects structures. \n \n<b>Maiev</b> \n•Health increased to 744, from 620. \n•Increased Damage by 20% \n \n<b>Emperor Thaurissan</b> \n•Moira's Wit - Healing increased to 1.5% of maximum Health, up from 1% of maximum Health. \n•Moira's Wit - Healing Trigger Radius increased from 8 to 12. \n•Incinerate - Lavaspikes now prefers new targets when attacking. \n \n<b>Grommash Hellscream</b> \n•Health increased to 1496, from 1360. \n \n<b>Orgrim Doomhammer</b> \n•Health reduced to 1000, from 1200. \n•The damage bonus from First Blood (Leader Ability) has been reduced to 75%, from 100%. \n•If Doomhammer is Polymorphed during the Mak'gora, the duel will be canceled. Doomhammer will be able to attempt a new Mak'gora challenge after polymorph wears off. \n•If either Doomhammer or the target get too far away from each other, the duel will be canceled. Doomhammer will be able to attempt a new Mak'gora challenge against the next valid target he finds. \n \n<i>Developer Note: Orgrim Doomhammer has been seen to be extremely effective in the Season 12 Meta.  We have received feedback that the games in Season 12 often feel stale and/or dominated by the same strategies, and we believe that Orgrim's base \nhealth and damage bonus are making him the obvious choice for raw power reasons rather than players choosing to play the leaders they find most exciting or fun to play.</i> \n \n<b>Cenarius</b> \n•Empty Health from Grovekeeper (Leader Ability) has been increased to 30%, from 20%. \n \n<b>Charlga</b> \n•Health increased to 416, from 320 \n•Charlga can now hit flying Minis with her beam. Any flying Minis hit with her beam will not be rooted. \n•Nature's Grasp - Damage reduction has been removed. \n \n<b>Rend</b> \n•Health increased to 1380, from 1200. \n \n<b>Hogger</b> \n•Ham Hock - Now grants 15% max Health each time he is played, up from 10%. \n•Fatal Frenzy - No longer has a range requirement, also now grants +1 Level to all Beasts (up to 3 additional levels). \n \n<b>Cairne</b> \n•Damage increased by 10%. \n \n<b>Jaina</b> \n•Flurry - Now always deals 50 damage in addition to applying Frost within the AOE, this excludes the main target. Gains the AOE trait. \n \n<b>Onu</b> \n•Health increased to 4660, from 4050. \n•Single target punch has been changed to a frontal cleave attack. \n•Fixed an issue that would cause Onu to target enemies from too far away. The range at which he acquires targets should now match most other melee Minis. \n•Petrified - Will now also summon 3 Treants on death. \n•Barkskin - Onu also gains armor now. \n \n<i>Developer Note: We felt Onu could be stronger to align with his 6 Gold cost. We'll continue to monitor Onu's and other Mini performance following these changes.</i></pre>",
				"troop_text_title": "Troop Balance",
				"troop_text": "<pre><b>Plague Farmer</b> \n•Splashing Pumpkins - Now has the same cooldown as the base attack, and now correctly doubles splash radius. \n \n<b>Witch Doctor</b> \n•Cursed Beam's range has been reduced to 7, from 8. \n•Cursed Beam's explosion radius has been reduced to 5, from 6. \n \n<i>Developer Note: Witch Doctor is an exceptionally efficient mini at only 2 Gold, and he is oppressing other strategies that would fill that role.  We wanted to find a way to create more space for other minis without fundamentally making Witch Doctor less fun to play. </i> \n \n<b>Deep Breath</b> \n•Initial damage has been reduced to 160, from 400. \n•Deep Breath now also applies Burn for 8 seconds. \n \n<i>Developer Note: The applied Burn deals 30 damage per second for a total of 240, meaning the total damage is still 400 but the damage dealt at a slower pace.</i> \n \n<b>Raptors</b> \n•Damage increased to 120, from 90.  \n•Motivation - Now retains Bloodlust for 10 seconds when approaching a chest or gold vein rather than only while near it. \n \n<b>Core Hounds</b> \n•Damage increased to 220, from 170. \n•Health increased to 1600, from 1420. \n•Fiery Revival - Upon revival, damage and burn nearby enemies. \n \n<b>Molten Giant</b> \n•Damage increased to 230, from 180. \n•Bolster - Now also grants 1 Gold when destroying a tower. Fixed an issue where Bolster was failing to heal. \n \n<b>Warsong Grunts</b> \n•Damage has been increased to 95, from 80. \n•Guard Duty - Now also grants Armored and reduces the Gold cost by 1. \n•Command - Now boosts Beast damage map wide rather than within a small range. \n \n<b>Gryphon Rider</b> \n•Airdrop - Now has a maximum of 10 levels that it can add to a Mini. \n \n<i>Developer Note: Bloodmage Thalnos and Sneed are capped at increasing levels by 10 and we are striving for consistency in the way Level Up effects impact minis.  This level cap was missed in the original implementation of Gryphon Rider and this change fixes that omission. We will continue to monitor how this impacts player ability to use strategies that involve leveling up minis to this cap.</i> \n \n<b>Swoll Troll</b> \n•Trollnado - Will no longer target enemies considered to be underground. This includes Minis that are under a bridge.</pre>",
				"pvp_rule_text_title": "Pvp Rule Changes",
				"pvp_rule_text": "<pre><b>Frostwolf Shaman</b> \n•Earthwall Totem - No longer affect player Barracks in Player versus Player (PvP), but will affect allied towers. \n \n<i>Developer Note: Earthwall Totem has become a defining part of the Pvp game, and with shorter matches and cycling decks players are able to maintain full base health even against relatively healthy onslaughts that deal some incidental damage to the barracks.  This is creating an environment of longer matches, more overtime kills, and significantly more draws than players are expecting.  We have been watching this talent for a while, and have decided that while it is fun to heal your base sometimes it is not conducive to a fun and competitive Pvp environment.</i></pre>"
			}
		],
		[
			"[11.1.0.113749] Leader Balance",
			1739383200,
			{
				"leader_text_title": "Leader Balance",
				"leader_text": "<pre><b>Malfurion</b>\n•Health reduced by 10%\n•Healing reduced from 70 to 50 per second.\n•Seeds of Protection reduced from 5 to 3.\n•Seeds begin decaying after 25 seconds, and then again every 5 seconds.\n\n<b>Ogrim Doomhammer</b>\n•Conquerer's Diplomacy - Bleed Out now kills the conquered mini in 15 seconds (down from 25).\n\n<b>Sylvanas Windrunner</b>\n•Damage reduced by 10%.\n•Queen's Reach - Attack speed reduced by 10%.\n\n<b>Anub'Arak</b>\n•Health of Scarabs has been reduced from 100 to 10.\n•Explosive Shells - Damage reduced from 45 to 35</pre>"
			}
		],
		[
			"[11.1.0.112797] Leader Balance",
			1737396000,
			{
				"leader_text_title": "Leader Balance",
				"leader_text": "<pre><b>Malfurion</b>\n•Healing over time reduced from 88 per second to 70 per second.\n\n<b>Onu</b>\n•Health increased by 35%\n\n<b>Ysera</b>\n•Emerald Whelps gain the Unbound Trait\n•Emerald Drake gains the Resistant Trait\n•Hibernate gold cost reduced from 2 to 1.\n\n<b>Sneed</b>\n•Health increased by 30%\n\n<font=\"Font_Header\"><Size=24><u><b>Troop Balance</u></b></size></font>\n\n<b>Druid of the Claw</b>\n•Health in Bear Form increased by 30%\n•Damage in Bear Form increased by 10%\n\n<b>Swole Troll</b>\n•Trollnado - Slightly increased range of effect\n•Trollnado - Attack speed increased from 8 to 7\n•Trollnado - More consistently does not target things it cannot knock back\n•Meatier Elbow - Damage increased from 200 to 210\n•Meatier Elbow - Attack speed increased from 4 to 3.2\n\n<b>Plague Farmer</b>\n•Health increased by 25%\n\n<b>Earth Elemental</b>\n•Health increased by 10%.\n\n<b>Ancient of War</b>\n•Lightning Rod - Requires spending 5 gold or more to redirect spells (up from 4)</pre>"
			}
		],
		[
			"[11.1.0.112070] PvP Changes",
			1732557600,
			{
				"pvp_text_title": "PvP Changes",
				"pvp_text": "<pre><size=24><b>Faster Matches</b></size>\n•PvP matches are reduced to 3 minutes (incl. 1 minute overtime), from 4m 30s previously.\n\n<size=24><b>Simplified MMR System</b></size>\n•The MMR system (Honor, Matchmaking) is simplified to a single Rating, rather than being tracked on a per Leader basis.\n•Any Leader can contribute to your total Honor in the new system (instead of just the Top 3), and all PvP matchmaking will be based on this single Honor rating.\n\n<size=24><b>Introducing Victory Road</b></size>\n•The old Honor Rewards track is replaced by Victory Road.\n•Earn Victory Points (VP) just by finishing PvP matches (wins & streaks provide more). Unlike Honor, VP are not lost upon defeat.\n•Earn rewards by achieving Victory Point milestones (like before). Victory Road resets each PvP Season, so make sure to claim your rewards on time!\n\n<size=24><b>End of Season Ranks & Rewards</b></size>\n•Winning PvP matches grants Honor, same as before.\n•Climb as high as you can on the new Leaderboard to earn amazing Placement rewards, including potentially a Season 11 Ranked Portrait!\n</pre>"
			}
		]
	],
	"timestamp": 1742482624
}