{"enUS": [["[11.2.0.113834] Custom Matchmaking & Event Missions", 1740424742, "Custom Matchmaking with selected number of players\n<pre>public Gryphon.Data.PvpSeasonComposition m_seasonComposition;\npublic int? m_playerCount;\npublic Guid m_missionGuid;\nCustomMatchmakingSettings(Gryphon.Data.PvpSeasonComposition seasonComposition, int? playerCount, Guid missionGuid);\n\nBeginCustomMatchmaking(IPvpMatchmakingService.CustomMatchmakingSettings matchmakingSettings);\nSendJoinCustomMatchmakerRequest(IPvpMatchmakingService.CustomMatchmakingSettings matchmakingSettings);</pre>Event Missions\n<pre>\"A one-tab version of the tabs subview that shows Rewards\"\n\"A two-tab version of the tabs subview that shows Challenges, Rewards\"\n\"A three-tab version of the tabs subview that shows Challenges, Missions, Rewards\"\n\nGryphon.Client.UI.SeasonalEvents.EventMissionInfo\nGryphon.Client.UI.SeasonalEvents.EventMissionList\n\nm_allowMultiples\n\"If checked, you can go beyond 1 instance of the mini at a time. This is useful for when you wantto add a mini to a deck, but ignore the add if the user already has that mini in the deck.\"\n\nm_gameplayConfigs\n\"Configuration for specific missions launched by this event.\nContent Gate = (Optional) Mission can only be played if the content gate is unlocked\nRequirement = (Optional) Mission can only be played if the requirement is met\nMission Ref = (Required) Mission to launch\nMission Variant = (Required) Variant of the mission to launch\nEvent Mode = (Optional) Special event mode to apply during the mission\nEvent Currency Reward For Mission = (Required) Amount of event currency to reward for playing\nShort Description = (Optional) Description which appears in mission list.\nShort Description Popup Format = (Optional) If set, the short description will also appear in the mission popup, using this format.\nLong Description = (Optional) Description which appears in mission popup. If unset, descriptions will come from the Event Mode or Mission Glue Info\"\n\nm_missionActiveText\n\"SeasonalEventContentGate/MissionActive\", \"Shown in mission list while missions are active\"\nm_missionLockedText\n\"SeasonalEventContentGate/MissionLocked\", \"Shown in mission list before missions are unlocked\"\n\nm_shortDescription\n\"SeasonalEvents/GameplayConfig/ShortDescription\", \"Short description text which appears in event mission list or popup\"\n\nm_requirementsMetFormat\n\"EventMissionInfo/RequirementsMet\", \"Describes mission requirements that have been met within the dialog body\"\nm_requirementsTooltipFormat\n\"EventMissionInfo/RequirementsTooltip\", \"Describes mission requirements that have not yet been met within the button tooltip\"\nm_requirementsUnmetFormat\n\"EventMissionInfo/RequirementsUnmet\", \"Describes mission requirements that have not yet been met within the dialog body\"</pre>"], ["[Patch Notes] Season 13", 1741825174, "Season 13 is coming, bringing Arthas Menethil, the Lich King, as a new Alliance and Undead Split Leader. We've made adjustments to Leaders, Troops, and Frostwolf Shaman in PvP.", "https://news.blizzard.com/article/24182549/"]], "timestamp": 1741825174}